shucai-ever/my-5008/source/pi5008k_rdk_micom/App/sample_code/src/sample_stm32f10x_it.c
/*******************************************************************************
* Function Name  : RCC_IRQHandler
* Description    : This function handles RCC interrupt request. 
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void RCC_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : EXTI0_IRQHandler
* Description    : This function handles External interrupt Line 0 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

static bool toggle_data_key1 = FALSE;

void EXTI0_IRQHandler(void)
{
    if(EXTI_GetITStatus(GPIO_EXTI_Line_KEY1) != RESET) {
        printf("Left-WKUP Button Press\n");

#if 0
        /* USB Remote Wakup ... */
        if (pInformation->Current_Feature & 0x20) //Remote wake-up enabled
        {
          Resume(RESUME_INTERNAL);
        }
#endif

        if(TRUE == g_TestProcessState)
        {
            Send_Buffer[0] = 0x05;

            if(toggle_data_key1)
            {
                toggle_data_key1 = FALSE;
                Send_Buffer[1] = 0x01;
            }
            else
            {
                toggle_data_key1 = TRUE;
                Send_Buffer[1] = 0x00;
            }

            UserToPMABufferCopy(Send_Buffer, ENDP1_TXADDR, 2);
            SetEPTxCount(ENDP1, 2);
            SetEPTxValid(ENDP1);
        }

        EXTI_ClearITPendingBit(GPIO_EXTI_Line_KEY1);
    }
}

/*******************************************************************************
* Function Name  : EXTI1_IRQHandler
* Description    : This function handles External interrupt Line 1 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

static bool toggle_data_key2 = FALSE;

void EXTI1_IRQHandler(void)
{
    if(EXTI_GetITStatus(GPIO_EXTI_Line_KEY2) != RESET) {
        printf("Right-USER Button Press\n");

        if(TRUE == g_TestProcessState)
        {
            Send_Buffer[0] = 0x06;

            if(toggle_data_key2)
            {
                toggle_data_key2 = FALSE;
                Send_Buffer[1] = 0x01;
            }
            else
            {
                toggle_data_key2 = TRUE;
                Send_Buffer[1] = 0x00;
            }

            UserToPMABufferCopy(Send_Buffer, ENDP1_TXADDR, 2);
            SetEPTxCount(ENDP1, 2);
            SetEPTxValid(ENDP1);
        }

        EXTI_ClearITPendingBit(GPIO_EXTI_Line_KEY2);
    }
}

/*******************************************************************************
* Function Name  : EXTI2_IRQHandler
* Description    : This function handles External interrupt Line 2 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void EXTI2_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : EXTI3_IRQHandler
* Description    : This function handles External interrupt Line 3 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void EXTI3_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : EXTI4_IRQHandler
* Description    : This function handles External interrupt Line 4 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void EXTI4_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA1_Channel1_IRQHandler
* Description    : This function handles DMA1 Channel 1 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA1_Channel1_IRQHandler(void)
{
    Send_Buffer[0] = 0x07;

    if((ADC_ConvertedValueX >>4) - (ADC_ConvertedValueX_1 >>4) > 4)
    {
        Send_Buffer[1] = (uint8_t)(ADC_ConvertedValueX >>4);
        UserToPMABufferCopy(Send_Buffer, ENDP1_TXADDR, 2);
        SetEPTxCount(ENDP1, 2);
        SetEPTxValid(ENDP1);
        ADC_ConvertedValueX_1 = ADC_ConvertedValueX;
    }

    DMA_ClearFlag(DMA1_FLAG_TC1);
}

/*******************************************************************************
* Function Name  : DMA1_Channel2_IRQHandler
* Description    : This function handles DMA1 Channel 2 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA1_Channel2_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA1_Channel3_IRQHandler
* Description    : This function handles DMA1 Channel 3 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA1_Channel3_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA1_Channel4_IRQHandler
* Description    : This function handles DMA1 Channel 4 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA1_Channel4_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA1_Channel5_IRQHandler
* Description    : This function handles DMA1 Channel 5 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA1_Channel5_IRQHandler(void)
{
}

